{
  "Aloe Vera": "Aloe Vera is a succulent known for its thick, fleshy leaves filled with gel used to treat burns, moisturize skin, and aid healing.",
  "Daffodils (Narcissus spp.)": "Daffodils are bright yellow or white springtime flowers that symbolize renewal but are toxic if ingested.",
  "Ponytail Palm (Beaucarnea recurvata)": "Despite its name, the Ponytail Palm is a drought-resistant succulent with a swollen trunk base and long, arching leaves.",
  "Money Tree (Pachira aquatica)": "The Money Tree is a popular houseplant with braided trunks, believed to bring good fortune, and thrives in bright, indirect light.",
  "Bird of Paradise (Strelitzia reginae)": "Known for its exotic orange and blue flowers resembling birds in flight, this tropical plant adds dramatic flair to indoor or garden spaces.",
  "Chrysanthemum": "Chrysanthemums are flowering plants with dense, colorful blooms often used decoratively and symbolically in various cultures.",
  "Elephant Ear (Alocasia spp.)": "Named for their large, heart-shaped leaves, Elephant Ear plants add a bold, tropical look to gardens and homes.",
  "Cast Iron Plant (Aspidistra elatior)": "The Cast Iron Plant is extremely hardy, tolerating low light and neglect, with dark green foliage that makes it a reliable houseplant.",
  "Prayer Plant (Maranta leuconeura)": "Prayer Plants are known for their uniquely patterned leaves that fold upward at night, resembling hands in prayer.",
  "Polka Dot Plant (Hypoestes phyllostachya)": "The Polka Dot Plant features brightly spotted leaves in pink, white, or red, making it a cheerful addition to indoor plant collections.",
  "Orchid": "Orchids are exotic flowering plants prized for their intricate, long-lasting blooms and are commonly grown indoors.",
  "English Ivy (Hedera helix)": "English Ivy is a fast-growing evergreen vine that can be used as ground cover or grown on walls and trellises.",
  "Tulip": "Tulips are spring-blooming perennials with cup-shaped flowers that come in a wide range of colors and are often associated with love and elegance.",
  "Anthurium (Anthurium andraeanum)": "Anthuriums are striking tropical plants known for their shiny heart-shaped leaves and long-lasting red, pink, or white spathes.",
  "Poinsettia (Euphorbia pulcherrima)": "Poinsettias are festive plants with bright red and green foliage, popular during the Christmas season.",
  "Peace lily": "Peace Lilies are graceful plants with glossy leaves and white spathes that help purify the air and thrive in low light.",
  "Chinese evergreen (Aglaonema)": "Chinese Evergreens are easy-care houseplants with variegated leaves that tolerate low light and humidity well.",
  "Kalanchoe": "Kalanchoes are succulent flowering plants with thick leaves and clusters of small, bright blooms in various colors.",
  "Birds Nest Fern (Asplenium nidus)": "The Bird's Nest Fern thrives in humid environments and is known for its wavy, nest-like fronds that grow outward from a central rosette.",
  "Lilium (Hemerocallis)": "Lilium, or daylilies, are flowering plants known for their large, trumpet-shaped blossoms that bloom for a single day each.",
  "Calathea": "Calatheas are tropical houseplants with stunning leaf patterns that fold up at night and reopen in the morning.",
  "Monstera Deliciosa (Monstera deliciosa)": "Monstera Deliciosa, or the Swiss Cheese Plant, is famous for its large, holey leaves and fast-growing nature.",
  "Snake plant (Sanseviera)": "Snake Plants are hardy, upright succulents with sword-like leaves, known for air purification and low maintenance.",
  "Hyacinth (Hyacinthus orientalis)": "Hyacinths are spring-blooming bulbs with fragrant, colorful flower spikes that add charm to gardens and pots.",
  "Boston Fern (Nephrolepis exaltata)": "Boston Ferns are lush, arching ferns that thrive in humid environments and are popular as hanging plants.",
  "Christmas Cactus (Schlumbergera bridgesii)": "The Christmas Cactus is a holiday-flowering succulent with segmented stems and blooms in winter.",
  "Schefflera": "Schefflera, or Umbrella Plants, are easy-to-grow houseplants with glossy leaves that radiate from a central stem.",
  "Iron Cross begonia (Begonia masoniana)": "Iron Cross Begonias are eye-catching plants with textured green leaves and a distinct brown cross pattern.",
  "African Violet (Saintpaulia ionantha)": "African Violets are compact flowering plants with fuzzy leaves and delicate violet-like blooms that prefer indirect light.",
  "Pothos (Ivy arum)": "Pothos is a vining houseplant with heart-shaped leaves that can be green or variegated, and it's extremely easy to grow.",
  "Parlor Palm (Chamaedorea elegans)": "The Parlor Palm is a small, elegant palm perfect for low-light indoor spaces and adds a soft tropical touch.",
  "Chinese Money Plant (Pilea peperomioides)": "Known for its round, pancake-shaped leaves, this plant is a trendy, fast-growing, and low-maintenance addition to homes.",
  "Begonia (Begonia spp.)": "Begonias are diverse plants grown for their colorful leaves and flowers, and they thrive both indoors and outdoors.",
  "Asparagus Fern (Asparagus setaceus)": "Asparagus Ferns are delicate, feathery plants that thrive in indirect light and are often used in floral arrangements.",
  "Ctenanthe": "Ctenanthe is a decorative tropical plant with patterned leaves that open and close with the light cycle.",
  "Lily of the valley (Convallaria majalis)": "Lily of the Valley is a fragrant flowering plant with small bell-shaped white blooms and is toxic if ingested.",
  "Areca Palm (Dypsis lutescens)": "Areca Palms are popular indoor palms with feathery fronds and are effective at purifying indoor air.",
  "Tradescantia": "Tradescantia, or Wandering Jew, is a fast-growing trailing plant with purple or green-striped leaves.",
  "Rattlesnake Plant (Calathea lancifolia)": "The Rattlesnake Plant has long, wavy leaves with dark green markings and a purple underside, great for low-light rooms.",
  "Dracaena": "Dracaenas are tough indoor plants with sword-like leaves that come in green or variegated varieties and require minimal care.",
  "Sago Palm (Cycas revoluta)": "Sago Palms are slow-growing plants with stiff, feather-like leaves and are toxic to pets if ingested.",
  "Yucca": "Yucca plants are hardy, spiky-leafed plants that prefer bright light and dry conditions, often used in xeriscaping.",
  "Venus Flytrap": "The Venus Flytrap is a carnivorous plant that catches and digests small insects using its jaw-like leaves triggered by touch.",
  "Jade plant (Crassula ovata)": "Jade Plants are popular succulents with thick, round leaves and are considered symbols of good luck.",
  "ZZ Plant (Zamioculcas zamiifolia)": "The ZZ Plant is an ultra-resilient houseplant with waxy, dark green leaves that thrive on neglect.",
  "Rubber Plant (Ficus elastica)": "Rubber Plants are tall houseplants with broad, glossy leaves and are great for improving indoor air quality.",
  "Dumb Cane (Dieffenbachia spp.)": "Dumb Canes are striking foliage plants with patterned leaves, but they can cause irritation if ingested or touched."
}